# [DataFrame 행/열 추가]

(1) 모듈 로딩 ----------------------------------------------

In [17]:
import pandas as pd

(2) 데이터 준비 ----------------------------------

In [18]:
#dict 타입의 데이터 생성
exam = { '이름':['마징가','배트맨','슈퍼맨','그린랜턴'],
         '국어':[100,99,88,77],
         '미술':[44,55,66,77],
         '수학':[55,44,66,22],
         '체육':[11,22,33,44]}

(3)

In [19]:
examDF=pd.DataFrame(exam)

In [20]:
examDF

     이름   국어  미술  수학  체육
0   마징가  100  44  55  11
1   배트맨   99  55  44  22
2   슈퍼맨   88  66  66  33
3  그린랜턴   77  77  22  44

In [21]:
def printAttribute(df, dfname):
    print(f'[{dfname} Attributes]')
    print(f'index\n ===> {examDF.index}')
    print(f'columns\n ===> {examDF.columns}')
    print(f'shape ===> {examDF.shape}')
    print(f'ndim ===> {examDF.ndim}')
    print(f'dtypes ===> {examDF.dtypes}')

In [22]:
printAttribute(examDF, 'examDF')

[examDF Attributes]
index
 ===> RangeIndex(start=0, stop=4, step=1)
columns
 ===> Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')
shape ===> (4, 5)
ndim ===> 2
dtypes ===> 이름    object
국어     int64
미술     int64
수학     int64
체육     int64
dtype: object

(4) 저장된 데이터 속성 확인

In [23]:
print(f'index ===> {examDF.index}')
print(f'columns ===> {examDF.columns}')
print(f'shape ===> {examDF.shape}')
print(f'ndim ===> {examDF.ndim}')
print(f'dtypes ===> {examDF.dtypes}')

index ===> RangeIndex(start=0, stop=4, step=1)
columns ===> Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')
shape ===> (4, 5)
ndim ===> 2
dtypes ===> 이름    object
국어     int64
미술     int64
수학     int64
체육     int64
dtype: object

(5) DataFrame에 컬럼(column) 추가 <hr>
- 방법 : DF객체변수명[새로운컬럼명]=값

In [26]:
examDF.columns

Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')

In [27]:
#행 갯수 만큼 값 추가
examDF['영어'] = [90,99,86,66]

In [28]:
examDF

     이름   국어  미술  수학  체육  영어
0   마징가  100  44  55  11  90
1   배트맨   99  55  44  22  99
2   슈퍼맨   88  66  66  33  86
3  그린랜턴   77  77  22  44  66

In [33]:
examDF['과학'] = 10
examDF

     이름   국어  미술  수학  체육  영어  과학
0   마징가  100  44  55  11  90  10
1   배트맨   99  55  44  22  99  10
2   슈퍼맨   88  66  66  33  86  10
3  그린랜턴   77  77  22  44  66  10

In [36]:
# 1개의 데이터 즉 값 추가 시 모든 행에 동일  값으로 저장
examDF[6] = 0
examDF

     이름   국어  미술  수학  체육  영어  과학  6
0   마징가  100  44  55  11  90  10  0
1   배트맨   99  55  44  22  99  10  0
2   슈퍼맨   88  66  66  33  86  10  0
3  그린랜턴   77  77  22  44  66  10  0

In [35]:
examDF.columns

Index(['이름', '국어', '미술', '수학', '체육', '영어', '과학', 6], dtype='object')

(6) DataFrame의 행 (row) cnrk <hr>
- 방법 : DF객체변수명.loc[새로운 행인덱스] = [컬럼수 만큼 데이터]
- 방법 : DF객체변수명.loc[새로운 행인덱스] = 데이터
- 불가 방법 : DF객체변수명.iloc[새로운 행인덱스] = 데이터 => 데이터 존재해야지 인덱스 할당됨

In [37]:
examDF.index

RangeIndex(start=0, stop=4, step=1)

In [38]:
# 컬럼 수 만큼의 데이터를 가진 행 추가
examDF.loc[4] = ['원더우먼', 90,87,11,55,66,44,100]

In [39]:
examDF

     이름   국어  미술  수학  체육  영어  과학    6
0   마징가  100  44  55  11  90  10    0
1   배트맨   99  55  44  22  99  10    0
2   슈퍼맨   88  66  66  33  86  10    0
3  그린랜턴   77  77  22  44  66  10    0
4  원더우먼   90  87  11  55  66  44  100

In [42]:
# 행 추가 시 iloc은 사용불가 => why? 데이터 수에 맞게 인덱스 범위 지정이 되기 때문에
# 현재 인덱스에 없는 인덱스로 불가
examDF.loc[5] = ['슈퍼맨', 90,87,11,55,66,44,100]
examDF

     이름   국어  미술  수학  체육  영어  과학    6
0   마징가  100  44  55  11  90  10    0
1   배트맨   99  55  44  22  99  10    0
2   슈퍼맨   88  66  66  33  86  10    0
3  그린랜턴   77  77  22  44  66  10    0
4  원더우먼   90  87  11  55  66  44  100
5   슈퍼맨   90  87  11  55  66  44  100

In [44]:
examDF.loc[6]='원펀맨'
examDF

     이름   국어   미술   수학   체육   영어   과학    6
0   마징가  100   44   55   11   90   10    0
1   배트맨   99   55   44   22   99   10    0
2   슈퍼맨   88   66   66   33   86   10    0
3  그린랜턴   77   77   22   44   66   10    0
4  원더우먼   90   87   11   55   66   44  100
5   슈퍼맨   90   87   11   55   66   44  100
6   원펀맨  원펀맨  원펀맨  원펀맨  원펀맨  원펀맨  원펀맨  원펀맨